# Написать игру
# python3 -m unittest test_rpg.py
# pytest -s

def game():
    # Поприветствуем юзера
    print("Привет, брат! Иди и сражайся")

# Главная функция, запустив которую начнется игра
game()