# Написать игру

def game():
    # Поприветствуем юзера
    print("Привет, брат! Иди и сражайся")

game()