# Написать игру

def game():
    # Поприветствуем юзера
    print("Привет, брат! Иди и сражайся")

# Главная функция, запустив которую начнется игра
game()